balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F3013.PIC
        <edc:SFRDef edc:access="-------rrrrrrrrr" edc:cname="U2RXREG" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="U2RXREG" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U2RXREG" edc:nzwidth="0x9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="URXREG0" edc:desc="" edc:mask="0x1" edc:name="URXREG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG1" edc:desc="" edc:mask="0x1" edc:name="URXREG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG2" edc:desc="" edc:mask="0x1" edc:name="URXREG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG3" edc:desc="" edc:mask="0x1" edc:name="URXREG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG4" edc:desc="" edc:mask="0x1" edc:name="URXREG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG5" edc:desc="" edc:mask="0x1" edc:name="URXREG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG6" edc:desc="" edc:mask="0x1" edc:name="URXREG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG7" edc:desc="" edc:mask="0x1" edc:name="URXREG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG8" edc:desc="" edc:mask="0x1" edc:name="URXREG8" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x8"/>
              <edc:SFRFieldDef edc:cname="URX8" edc:desc="" edc:mask="0x1" edc:name="URX8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="U2BRG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="U2BRG" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BRG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="BRG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n------c----nn" edc:cname="SPI1STAT" edc:desc="" edc:impl="0xa043" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0------0----00" edc:name="SPI1STAT" edc:nzwidth="0x10" edc:por="0-0------0----00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPIRBF" edc:desc="" edc:mask="0x1" edc:name="SPIRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPITBF" edc:desc="" edc:mask="0x1" edc:name="SPITBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SPIROV" edc:desc="" edc:mask="0x1" edc:name="SPIROV" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SPISIDL" edc:desc="" edc:mask="0x1" edc:name="SPISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIEN" edc:desc="" edc:mask="0x1" edc:name="SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="SPI 1" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn-nnnnnnnnnnnn" edc:cname="SPI1CON" edc:desc="" edc:impl="0x6fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00-000000000000" edc:name="SPI1CON" edc:nzwidth="0x10" edc:por="-00-000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="" edc:mask="0x1" edc:name="PPRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE1" edc:desc="" edc:mask="0x1" edc:name="PPRE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPRE0" edc:desc="" edc:mask="0x1" edc:name="SPRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPRE1" edc:desc="" edc:mask="0x1" edc:name="SPRE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPRE2" edc:desc="" edc:mask="0x1" edc:name="SPRE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MSTEN" edc:desc="" edc:mask="0x1" edc:name="MSTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSEN" edc:desc="" edc:mask="0x1" edc:name="SSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DISSDO" edc:desc="" edc:mask="0x1" edc:name="DISSDO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIFSD" edc:desc="" edc:mask="0x1" edc:name="SPIFSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PPRE" edc:desc="" edc:mask="0x1" edc:name="PPRE0" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SPRE" edc:desc="" edc:mask="0x1" edc:name="SPRE0" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPI1BUF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPI1BUF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPI1BUF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
